<a href="https://colab.research.google.com/github/ZawWin58/firstproject/blob/master/lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
pd.set_option("display.width", 70)

In [0]:
data = pd.read_csv('adult11.csv')
data.head()

   age  workclass  fnlwgt  ... hours-per-week  native-country salary
0   25    Private  226802  ...           40.0   United-States  <=50K
1   38    Private   89814  ...           50.0   United-States  <=50K
2   28  Local-gov  336951  ...           40.0   United-States   >50K
3   44    Private  160323  ...           40.0   United-States   >50K
4   18          ?  103497  ...           30.0   United-States  <=50K

[5 rows x 15 columns]

In [0]:
data["gender"].value_counts()

Male      19301
Female     9553
Name: gender, dtype: int64

In [0]:
data[data["gender"] == "Female"]["age"].mean()

36.98230922223385

In [0]:
print("{0:%}".format(data[data["native-country"] == "Germany"]
.shape[0] / data.shape[0]))

0.440132%

In [0]:
ages1 = data[data["salary"] == "<=50K"]["age"]
ages2 = data[data["salary"] == ">50K"]["age"]
print("<=50K: = {0} ± {1} years".format(ages1.mean(), ages1.std()))
print(" >50K: = {0} ± {1} years".format(ages2.mean(), ages2.std()))

<=50K: = 36.90999590890495 ± 14.166242134563927 years
 >50K: = 44.1671772428884 ± 10.52773245753095 years

In [0]:
high_educations = set(["Bachelors", "Prof-school", "Assoc-acdm",
                      "Assoc-voc", "Masters", "Doctorate"])
def high_educated(e):
    return e in high_educations
data[data["salary"] == ">50K"]["education"].map(high_educated).all()

False

In [0]:
data.groupby(["race", "gender"])["age"].describe()

                             count       mean        std  ...   50%   75%   max
race               gender                                 ...
Amer-Indian-Eskimo Female    115.0  34.930435  12.322937  ...  33.0  41.5  63.0
                   Male      160.0  37.125000  11.781955  ...  35.0  44.0  82.0
Asian-Pac-Islander Female    300.0  36.350000  13.155139  ...  35.0  45.0  81.0
                   Male      564.0  38.843972  12.891560  ...  37.0  47.0  90.0
Black              Female   1338.0  38.354260  12.967195  ...  37.0  47.0  81.0
                   Male     1422.0  38.059775  13.239203  ...  36.0  46.0  90.0
Other              Female     80.0  30.737500  10.861317  ...  28.0  36.0  64.0
                   Male      153.0  34.954248  11.800613  ...  32.0  41.0  67.0
White              Female   7720.0  36.864378  14.488046  ...  35.0  46.0  90.0
                   Male    17002.0  39.650629  13.475728  ...  38.0  49.0  90.0

[10 rows x 8 columns]

In [0]:
data[(data["race"] == "Amer-Indian-Eskimo")
& (data["gender"] == "Male")]["age"].max()

82

In [0]:
def is_married(m):
    return m.startswith("Married")
data["married"] = data["marital-status"].map(is_married)
(data[(data["gender"] == "Male") & (data["salary"] == ">50K")]
    ["married"].value_counts())

True     5237
False     567
Name: married, dtype: int64

In [0]:
m = data["hours-per-week"].max()
print("Maximum is {} hours/week.".format(m))
people = data[data["hours-per-week"] == m]
c = people.shape[0]
print("{} people work this time at week.".format(c))
s = people[people["salary"] == ">50K"].shape[0]
print("{0:%} get >50K salary.".format(s / c))

Maximum is 99.0 hours/week.
75 people work this time at week.
32.000000% get >50K salary.

In [0]:
p = pd.crosstab(data["native-country"], data["salary"],
values=data['hours-per-week'], aggfunc="mean")p
p

salary                          <=50K       >50K
native-country
?                           38.637883  45.384058
Cambodia                    41.307692  47.000000
Canada                      36.411765  46.456522
China                       35.900000  44.380952
Columbia                    40.513514  56.250000
Cuba                        40.825397  40.937500
Dominican-Republic          40.962963  42.800000
Ecuador                     36.875000  47.333333
El-Salvador                 35.231707  43.600000
England                     38.148936  46.384615
France                      41.100000  39.166667
Germany                     38.223404  45.969697
Greece                      44.333333  56.428571
Guatemala                   38.062500  40.000000
Haiti                       34.386364  39.166667
Honduras                    32.090909  50.000000
Hong                        38.181818  40.000000
Hungary                     36.000000  42.666667
India                       39.207547  44.470588
Iran                        39.458333  48.000000
Ireland                     40.933333  44.111111
Italy                       38.333333  44.500000
Jamaica                     39.780000  43.909091
Japan                       38.972973  43.666667
Laos                        37.777778        NaN
Mexico                      39.870229  46.214286
Nicaragua                   36.760000  40.000000
Outlying-US(Guam-USVI-etc)  41.666667  40.000000
Peru                        37.318182  40.000000
Philippines                 39.096000  44.585366
Poland                      38.795455  38.300000
Portugal                    40.000000  47.100000
Puerto-Rico                 39.101852  39.866667
Scotland                    40.000000        NaN
South                       42.721311  51.666667
Taiwan                      39.600000  44.000000
Thailand                    46.500000  53.750000
Trinadad&Tobago             39.266667        NaN
United-States               38.883042  45.430669
Vietnam                     39.523810  40.000000
Yugoslavia                  36.500000  32.500000

In [0]:
p.loc["Japan"]

salary
<=50K    38.972973
>50K     43.666667
Name: Japan, dtype: float64

In [0]:
!pip install pandasql
from pandasql import sqldf
import pandas as pd

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.18.2)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.0.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.15)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26819 sha256=b4b1731df8dde4de1262d2d4d7d6452f3baef67175b78a62158faac3caa9b037
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [0]:
wind = (pd.read_csv('wind speed.csv', header=None,
names=["row", "UNIX", "date",
"time", "speed", "text"])
.drop("text", axis=1))
temp = (pd.read_csv('temperature.csv', header=None,
names=["row", "UNIX", "date",
"time", "temperature", "text"])
.drop("text", axis=1))

In [0]:
wind.head()

   row        UNIX        date      time  speed
0    1  1475315718  2016-09-30  23:55:18   7.87
1    2  1475315423  2016-09-30  23:50:23   7.87
2    3  1475315124  2016-09-30  23:45:24   9.00
3    4  1475314821  2016-09-30  23:40:21  13.50
4    5  1475314522  2016-09-30  23:35:22  15.75

In [0]:
wind.dtypes

row        int64
UNIX       int64
date      object
time      object
speed    float64
dtype: object

In [0]:
temp.head()

   row        UNIX        date      time  temperature
0    1  1475315718  2016-09-30  23:55:18           48
1    2  1475315423  2016-09-30  23:50:23           48
2    3  1475315124  2016-09-30  23:45:24           48
3    4  1475314821  2016-09-30  23:40:21           48
4    5  1475314522  2016-09-30  23:35:22           48

In [0]:
temp.dtypes

row             int64
UNIX            int64
date           object
time           object
temperature     int64
dtype: object

In [0]:
wind.merge(temp[["UNIX", "temperature"]], on="UNIX").head()

   row        UNIX        date      time  speed  temperature
0    1  1475315718  2016-09-30  23:55:18   7.87           48
1    2  1475315423  2016-09-30  23:50:23   7.87           48
2    3  1475315124  2016-09-30  23:45:24   9.00           48
3    4  1475314821  2016-09-30  23:40:21  13.50           48
4    5  1475314522  2016-09-30  23:35:22  15.75           48

In [0]:
%%timeit
wind.merge(temp[["UNIX", "temperature"]], on="UNIX")

100 loops, best of 3: 10.9 ms per loop

In [0]:
pysqldf("""SELECT w.row, w.UNIX, w.date, w.time,
w.speed, t.temperature
FROM wind AS w JOIN temp AS t
ON w.UNIX = t.UNIX
""").head()

   row        UNIX        date      time  speed  temperature
0    1  1475315718  2016-09-30  23:55:18   7.87           48
1    2  1475315423  2016-09-30  23:50:23   7.87           48
2    3  1475315124  2016-09-30  23:45:24   9.00           48
3    4  1475314821  2016-09-30  23:40:21  13.50           48
4    5  1475314522  2016-09-30  23:35:22  15.75           48

In [0]:
%%timeit
pysqldf("""SELECT w.row, w.UNIX, w.date, w.time,
                  w.speed, t.temperature
            FROM wind AS w JOIN temp AS t
            ON w.UNIX = t.UNIX
        """)

1 loop, best of 3: 505 ms per loop

In [0]:
wind.groupby("date")["speed"].mean().head()

date
2016-09-01    6.396560
2016-09-02    5.804086
2016-09-03    4.960248
2016-09-04    5.184571
2016-09-05    5.830676
Name: speed, dtype: float64

In [0]:
%%timeit
wind.groupby("date")["speed"].mean()

100 loops, best of 3: 2.72 ms per loop

In [0]:
pysqldf("""SELECT date, AVG(speed)
FROM wind
GROUP BY date
""").head()

         date  AVG(speed)
0  2016-09-01    6.396560
1  2016-09-02    5.804086
2  2016-09-03    4.960248
3  2016-09-04    5.184571
4  2016-09-05    5.830676

In [0]:
%%timeit
pysqldf("""SELECT date, AVG(speed)
FROM wind
GROUP BY date
""")

1 loop, best of 3: 202 ms per loop